# Описание

**employees** Таблица с информацией по сотрудникам

- emp_no - id сотрудника
- title - Название должности
- birth_date - дата рождения
- first_name - Имя
- first_name - Фамилия
- gender - пол
- hire_date - первая дата устройства на работу

**dept_emp** - Таблица с информацией в каком департаменте работает сотрудник

- emp_no - id сотрудника
- dept_name - Название департамента
- from_date - дата начала работы в департаменте
- to_date - дата ококнчания работы в департаменте (если 9999-01-01 - то работает по наст время)


**dept_manager** - Таблица с информацией в каком департаменте работает менеджер

- emp_no - id менеджера (сотрудника)
- dept_name - Название департамента
- from_date - дата начала работы в департаменте
- to_date - дата ококнчания работы в департаменте (если 9999-01-01 - то работает по наст время)


**salaries** - Таблица с информацией о зарплатах сотрудников

- emp_no - id сотрудника
- salaries - Зарплата

In [1]:
%load_ext sql

Укажите путь до места сохранения EmployeeSQL.db, данный путь был приведен в качестве примера

In [2]:
%sql sqlite:///EmployeeSQL.db

In [3]:
%%sql

SELECT name FROM sqlite_master

 * sqlite:///EmployeeSQL.db
Done.

[('employees',),
 ('dept_manager',),
 ('dept_emp',),
 ('salaries',),
 ('emp_test',)]

1) Выведите первые 10 строк из таблицы dept_emp

In [4]:
%%sql

Select *
from dept_emp
limit 10

 * sqlite:///EmployeeSQL.db
Done.

[(10001, 'Development', '1986-06-26', '9999-01-01'),
 (10002, 'Sales', '1996-08-03', '9999-01-01'),
 (10003, 'Production', '1995-12-03', '9999-01-01'),
 (10004, 'Production', '1986-12-01', '9999-01-01'),
 (10005, 'Human Resources', '1989-09-12', '9999-01-01'),
 (10006, 'Development', '1990-08-05', '9999-01-01'),
 (10007, 'Research', '1989-02-10', '9999-01-01'),
 (10008, 'Development', '1998-03-11', '2000-07-31'),
 (10009, 'Quality Management', '1985-02-18', '9999-01-01'),
 (10010, 'Production', '1996-11-24', '2000-06-26')]

2) Создать таблицу employees_2 на основании employees, где создадите дополнительные столбцы:
- месяц рождения (по столбцу birth_date)
- год рождения (по столбцу birth_date)

Проверьте, создалась ли таблица. Выведите первые 5 строк

In [5]:
%%sql

drop table if exists employees_2;
create table if not exists employees_2 as
Select *, strftime('%m', birth_date) as m_birth, strftime('%Y', birth_date) as y_birth
from employees

 * sqlite:///EmployeeSQL.db
Done.
Done.

[]

In [6]:
%%sql

Select *
from employees_2
limit 5

 * sqlite:///EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26', '09', '1953'),
 (10002, 'Staff', '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21', '06', '1964'),
 (10003, 'Senior Engineer', '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28', '12', '1959'),
 (10004, 'Senior Engineer', '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01', '05', '1954'),
 (10005, 'Staff', '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12', '01', '1955')]

3) Удалите таблицу employees_2

In [7]:
%%sql

drop table if exists employees_2;

 * sqlite:///EmployeeSQL.db
Done.

[]

4) Найдите всех сотрудников чье имя Georgi. Выведите первые 5 строк

In [8]:
%%sql

Select *
from employees
where "first_name" = "Georgi"
limit 5

 * sqlite:///EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26'),
 (10909, 'Senior Engineer', '1954-11-11', 'Georgi', 'Atchley', 'M', '1985-04-21'),
 (11029, 'Senior Staff', '1962-07-12', 'Georgi', 'Itzfeldt', 'M', '1992-12-27'),
 (11430, 'Staff', '1957-01-23', 'Georgi', 'Klassen', 'M', '1996-02-27'),
 (12157, 'Staff', '1960-03-30', 'Georgi', 'Barinka', 'M', '1985-06-04')]

5) Найдите всех сотрудников чье имя Georgi, которые до сих пор работают в компании (использовать также таблицу dept_emp, поле to_date = 9999-01-01). Выведите первые 5 строк, содержащих имя, фамилию, должность, дату начала работы, а также дату окончания работы (из dept_emp)

In [9]:
%%sql

Select e.first_name, e.last_name, e.title, e.hire_date, d.to_date
from employees e
join dept_emp d on e.emp_no = d.emp_no
where e.first_name = "Georgi" and d.to_date = "9999-01-01"
limit 5

 * sqlite:///EmployeeSQL.db
Done.

[('Georgi', 'Facello', 'Senior Engineer', '1986-06-26', '9999-01-01'),
 ('Georgi', 'Atchley', 'Senior Engineer', '1985-04-21', '9999-01-01'),
 ('Georgi', 'Itzfeldt', 'Senior Staff', '1992-12-27', '9999-01-01'),
 ('Georgi', 'Klassen', 'Staff', '1996-02-27', '9999-01-01'),
 ('Georgi', 'Barinka', 'Staff', '1985-06-04', '9999-01-01')]

6) Вывести топ 2 заплаты в каждом департаменте. 

Подсказка:

**Использовать оконные функции**, можно и виртуальные таблицы, аккуратно производите нумерацию, использовать сортировку по убыванию в самой оконной функции, а также JOIN. Если в департаменте несколько похожих зарплат, то учитывать только **уникальное значение**!

Пример вывода:

| dept_name        | salary|
|--------------|-----------|
|Customer Service | 1000|
|Customer Service | 999|
|Development      | 1000|
|Development      | 999|

In [32]:
%%sql

Select dept_name, salary
from (
    Select d.dept_name, salary,
         dense_rank() over(partition by d.dept_name order by salary desc) as rank
    from dept_emp d
    join salaries s on d.emp_no = s.emp_no) t
where rank < 3
limit 10

 * sqlite:///EmployeeSQL.db
Done.

[('Customer Service', 122423),
 ('Customer Service', 120032),
 ('Development', 110449),
 ('Development', 106109),
 ('Finance', 114784),
 ('Finance', 113236),
 ('Human Resources', 110308),
 ('Human Resources', 101593),
 ('Marketing', 118250),
 ('Marketing', 116412)]

7) Найдите 2 по счету максимальную зарплату **среди менеджеров** **двумя способами обязательно!**:
- с использованием подзапроса
- с использованием limit

Вывести id менеджера и значение зарплаты

In [41]:
%%sql

Select emp_no, salary
from (
    Select m.emp_no, s.salary,
        dense_rank() over(order by salary desc) as r
    from dept_manager m
    join salaries s on m.emp_no = s.emp_no) t
where r = 2

 * sqlite:///EmployeeSQL.db
Done.

[(111035, 71612)]

In [47]:
%%sql

Select m.emp_no, s.salary
from dept_manager m
join salaries s on m.emp_no = s.emp_no
order by s.salary desc
limit 1, 1

 * sqlite:///EmployeeSQL.db
Done.

[(111035, 71612)]

8) Вывести среднюю зарплату и название тех депаратаментов (dept_emp), где **среднее значение зарплаты** больше 50000


Пример вывода:

|dept_name        | avg salary|
|------|------|
|Customer Service | 51000|
|Development      | 50500|

In [49]:
%%sql

Select d.dept_name, ROUND(AVG(s.salary)) as "avg salary"
from dept_emp d
join salaries s on d.emp_no = s.emp_no
group by dept_name
having AVG(s.salary) > 50000

 * sqlite:///EmployeeSQL.db
Done.

[('Finance', 59534.0), ('Marketing', 61096.0), ('Sales', 69832.0)]

9) Выведите среднюю зарплату по всем сотрудникам и округлите при помощи round()

In [4]:
%%sql

Select distinct round(AVG(salary) Over()) as avg_salary
from salaries

 * sqlite:///EmployeeSQL.db
Done.

[(52971.0,)]

In [6]:
%%sql

SELECT round(AVG(salary), 0) as avg_salary
from salaries

 * sqlite:///EmployeeSQL.db
Done.

[(52971.0,)]

10) Выведите первые 10 строк:
- id сотрудника (относится ко всем сотрудникам)
- Имя сотрудника
- Фамилию сотрудника
- Должность
- Департамент
- Зарплату (иметь в виду, что это число, а не строка)
- Дату начала работы в департаменте
- Дату окончания работы в департаменте
- **Флаг** того, что человек работает в данном депаратаменте (**если стоит дата 9999-01-01, то человек продолжает работать и ставим 1, иначе 0 (то есть уже не работает)**)
- Флаг того, что его зарплата выше средней, если **1 - выше средней или равно, иначе 0** (значение расчитано в задании 9, можно скопировать значение руками)

Используйте CASE

In [9]:
%%sql

Select d.*, e.title, e.first_name, e.last_name, s.salary,
    case 
        when (d.to_date = "9999-01-01") then 1 
        else 0 
        end as work_now,
    case 
        when (s.salary > 52971) then 1 
        else 0 
        end as high_avg_sal
from employees e
join salaries s USING(emp_no)
join dept_emp d on e.emp_no = d.emp_no
limit 10

 * sqlite:///EmployeeSQL.db
Done.

[(10001, 'Development', '1986-06-26', '9999-01-01', 'Senior Engineer', 'Georgi', 'Facello', 60117, 1, 1),
 (10002, 'Sales', '1996-08-03', '9999-01-01', 'Staff', 'Bezalel', 'Simmel', 65828, 1, 1),
 (10003, 'Production', '1995-12-03', '9999-01-01', 'Senior Engineer', 'Parto', 'Bamford', 40006, 1, 0),
 (10004, 'Production', '1986-12-01', '9999-01-01', 'Senior Engineer', 'Chirstian', 'Koblick', 40054, 1, 0),
 (10005, 'Human Resources', '1989-09-12', '9999-01-01', 'Staff', 'Kyoichi', 'Maliniak', 78228, 1, 1),
 (10006, 'Development', '1990-08-05', '9999-01-01', 'Senior Engineer', 'Anneke', 'Preusig', 40000, 1, 0),
 (10007, 'Research', '1989-02-10', '9999-01-01', 'Staff', 'Tzvetan', 'Zielinski', 56724, 1, 1),
 (10008, 'Development', '1998-03-11', '2000-07-31', 'Assistant Engineer', 'Saniya', 'Kalloufi', 46671, 0, 0),
 (10009, 'Quality Management', '1985-02-18', '9999-01-01', 'Senior Engineer', 'Sumant', 'Peac', 60929, 1, 1),
 (10010, 'Production', '1996-11-24', '2000-06-26', 'Engineer', 'Duangkaew', 'Piveteau', 72488, 0, 1)]

11) Найдите **кол-во** уникальных сотрудников **в каждом департаменте** в разрезе **должности**

Пример вывода:

|dept_name	| title	| count_emp|
|------|-----|----|
|Development	| Engineer |	20|
|Development	| Staff    |	10|

In [12]:
%%sql

Select dept_name, title, count() as count_emp
from employees e
join dept_emp d on e.emp_no = d.emp_no
group by dept_name, title

 * sqlite:///EmployeeSQL.db
Done.

[('Customer Service', 'Assistant Engineer', 108),
 ('Customer Service', 'Engineer', 944),
 ('Customer Service', 'Manager', 4),
 ('Customer Service', 'Senior Engineer', 2027),
 ('Customer Service', 'Senior Staff', 4041),
 ('Customer Service', 'Staff', 16147),
 ('Customer Service', 'Technique Leader', 309),
 ('Development', 'Assistant Engineer', 2987),
 ('Development', 'Engineer', 23938),
 ('Development', 'Manager', 2),
 ('Development', 'Senior Engineer', 49326),
 ('Development', 'Senior Staff', 349),
 ('Development', 'Staff', 1424),
 ('Development', 'Technique Leader', 7681),
 ('Finance', 'Manager', 2),
 ('Finance', 'Senior Staff', 3415),
 ('Finance', 'Staff', 13929),
 ('Human Resources', 'Manager', 2),
 ('Human Resources', 'Senior Staff', 3443),
 ('Human Resources', 'Staff', 14341),
 ('Marketing', 'Manager', 2),
 ('Marketing', 'Senior Staff', 4013),
 ('Marketing', 'Staff', 16196),
 ('Production', 'Assistant Engineer', 2474),
 ('Production', 'Engineer', 20416),
 ('Production', 'Manager', 4),
 ('Production', 'Senior Engineer', 42203),
 ('Production', 'Senior Staff', 357),
 ('Production', 'Staff', 1478),
 ('Production', 'Technique Leader', 6553),
 ('Quality Management', 'Assistant Engineer', 735),
 ('Quality Management', 'Engineer', 5725),
 ('Quality Management', 'Manager', 4),
 ('Quality Management', 'Senior Engineer', 11863),
 ('Quality Management', 'Technique Leader', 1790),
 ('Research', 'Assistant Engineer', 127),
 ('Research', 'Engineer', 1245),
 ('Research', 'Manager', 2),
 ('Research', 'Senior Engineer', 2570),
 ('Research', 'Senior Staff', 3295),
 ('Research', 'Staff', 13494),
 ('Research', 'Technique Leader', 393),
 ('Sales', 'Manager', 2),
 ('Sales', 'Senior Staff', 10437),
 ('Sales', 'Staff', 41806)]